
* Org-timeblock
:PROPERTIES:
:ID:       3d2289b4-9dea-4b6e-b23e-243a214657a5
:END:

#+BEGIN_SRC emacs-lisp
(use-package org-timeblock
  :ensure t
  :bind ("C-c s" . org-timeblock)
  :config
  (setq org-timeblock-files (directory-files-recursively "/home/andrew/workspace/org/workspace/" "\\.org$"))
  (setq org-timeblock-inbox-file "/home/andrew/workspace/org/workspace/inbox.org")
)

(setq org-tag-faces
      '(("english" . (:foreground "#FFB6C1" :weight bold)) ; Soft pink
        ("newtend" . (:foreground "#90EE90" :weight bold)) ; Light green
        ("proxyua" . (:foreground "#00FA9A" :weight bold)))) ; Green with aqua (Medium Spring Green)
#+END_SRC

#+RESULTS:
| english | :foreground | #FFB6C1 | :weight | bold |
| newtend | :foreground | #90EE90 | :weight | bold |
| proxyua | :foreground | #00FA9A | :weight | bold |




#+RESULTS:
: vertico-directory-delete-word

